from common import *

def main():

    # ID -> {name, sub: [{name, listid}]}
    toms = {
        "1": {"id": "main-tom-1", "name": "Том 1 : Списки 27.02.1937 – 26.06.1937", "sub": []},
        "2": {"id": "main-tom-2", "name": "Том 2 : Списки 10.07.1937 – 31.08.1937", "sub": []},
        "3": {"id": "main-tom-3", "name": "Том 3 : Списки 07.09.1937 – 21.10.1937", "sub": []},
        "4": {"id": "main-tom-4", "name": "Том 4 : Списки 21.10.1937 – 13.11.1937", "sub": []},
        "5": {"id": "main-tom-5", "name": "Том 5 : Списки 13.11.1937 – 22.12.1937 (+ фрагменты списка 04.10.1936)", "sub": []},
        "6": {"id": "main-tom-6", "name": "Том 6 : Списки 03.01.1938 – 14.02.1938", "sub": []},
        "7": {"id": "main-tom-7", "name": "Том 7 : Списки 05.03.1938 – 28.03.1938", "sub": []},
        "8": {"id": "main-tom-8", "name": "Том 8 : Списки 19.04.1938 – 03.05.1938", "sub": []},
        "9": {"id": "main-tom-9", "name": "Том 9 : Списки 10.06.1938 – 20.08.1938", "sub": []},
        "10": {"id": "main-tom-10", "name": "Том 10 : Списки 12.09.1938 – 12.09.1938", "sub": []},
        "11": {"id": "main-tom-11", "name": "Том 11 : Списки 12.09.1938 – 29.09.1938", "sub": []},
    }
    for lst in csv_reader(LISTS_CSV):
        t = lst["tom"]
        if int(t) > 11:
            continue
        data = {
            "name": list2title(lst),
            "listid": lst["listid"]
        }
        toms[t]["sub"].append(data)

    # Main korpus:
    # {name, sub: [{id, name, sub: [{name, listid}]}]}
    #
    # Korpus with categories:
    # {name, sub: [{name, listid}]}
    #
    # Plain korpus:
    # {name, listid}
    #
    # Not found korpus:
    # {name}
    korps = [
        {
            "name": "Список 04.10.1936 (585 человек, два сохранившихся фрагмента см. в конце 5 тома основного корпуса)"
        },
        {
            "name": "Основной корпус: Списки 27.02.1937 – 29.09.1938 (РГАСПИ. Ф.17. Оп.171. Д.409–419)",
            "sub": list(toms.values())
        },

        {
            "name": "Список 16.02.1939 (469 человек, не обнаружен)"
        },
        {
            "name": "Список 27.06.1939 (513 человек, не обнаружен)"
        },
        {
            "name": "Список 16.01.1940 (РГАСПИ. Ф.17. Оп.171. Д.377. Л.116–136)",
            "sub": [
                {"name": "1-я категория", "listid": 407},
                {"name": "2-я категория", "listid": 408},
            ]
        },
        {
            "name": "Список 06.09.1940 (РГАСПИ. Ф.17. Оп.171. Д.421. Л.1–492; Д.420. Л.1–68)",
            "sub": [
                {"name": "1-я категория", "listid": 410},
                {"name": "2-я категория", "listid": 413},
            ]
        },
        {
            "name": "Список 30.04.1941 (931 человек, не обнаружен)"
        },
        {
            "name": "Список 30.04.1941 (1302 человека, не обнаружен)"
        },
        {
            "name": "Список 29.01.1942 (РГАСПИ. Ф.17. Оп.171. Д.378. Л.196–211)",
            "listid": 409
        },
        {
            "name": "Список 23.03.1950 (АП РФ. Ф.3. Оп.57. Д.100. Л.2–54)",
            "listid": 411
        },
        {
            "name": "Список 11.04.1950 (АП РФ. Ф.3. Оп.57. Д.100. Л.55–76.)",
            "listid": 412
        },
        {
            "name": "Список 22.07.1950 (31 человек, не обнаружен)"
        },
        {
            "name": "Список 24.10.1950 (38 человек, не обнаружен)"
        },
        {
            "name": "Список 07.07.1951 (53 человека, не обнаружен)"
        },
    ]

    yaml_writer(
        os.path.join(HUGO_DATA_DIR, "korps.yaml"),
        korps
    )



if __name__ == "__main__":
    main()
