# Computes following structure out of titles.csv
#
# [[geo_id, title, geosub_id, title_id]]
#
# * geo_id is ageographyid (the same as "regionid" in geogr.csv)
# * title is "sublisttitle//subgeogroup""
# * geosub_id is a new id assigned by this script. Unique for geo_id+title
# * title_id - original id
#
# Output files:
#
# * geosub.json: geo_id -> {geosub_id -> title}
# * title2geosub.yaml: title_id -> geosub_id

from common import *
import os
import os.path
import re


def main():
    records = []
    geosub_index = {}
    next_id = 1
    for t in csv_reader(TITLES_CSV):
        geo_id = t["ageographyid"]
        title = get_title(t)
        code = "%s:%s" % (geo_id, fix_title(title))
        geosub_id = geosub_index.get(code)
        if not geosub_id:
            geosub_id = next_id
            next_id = next_id + 1
            geosub_index[code] = geosub_id

        title_id = t['titleid']
        records.append([geo_id, title, geosub_id, title_id])

    print ("geosub num:", next_id-1)
    # geosub.json
    geosub_data = {}
    title2geosub_data = {}
    for geo_id, title, geosub_id, title_id in records:
        title2geosub_data[title_id] = geosub_id
        geosub_data.setdefault(geo_id, {})
        geosub_data[geo_id][geosub_id] = fix_title(title)

    yaml_writer("TITLE2GEOSUB_YAML", title2geosub_data)
    json_writer("data2hugo/geosub.json", geosub_data, sort_keys=True, indent=4)


def get_title(t):
    title = t["sublisttitle"]
    if t["subgeogroup"]:
        title += " // " + t["subgeogroup"]
    return title

def fix_title(code):
    for g in SYNONYMS:
        if code in g:
            return g[0]
    return code


# values depends on get_title
SYNONYMS = [
    [
        "Украинская ССР // Харьков - Южная жел.дор.",
        "г.Харьков // ДТО Южных жел.дор.",
        "г.Харьков - Южная жел.дорога",
        "Гор.Харьков.-Южная жел.дор.",
        "Гор.Харьков. Южная жел.дор.",
        "г.Харьков. Южная жел.дор.",
    ],
    [
        "Казахская ССР // Северо-Казахстанская область",
        "Казахская ССР // Северно-Казахстанская область",
    ],
    [
        "г.Воронеж Московско-Донбасск. ж.д.",
        "г.Воронеж.-Моск.Донбасская ж.д.",
    ],
    [
        "г.Воронеж Юго-Восточная жел.дор.",
        "г.Воронеж. Юго-Восточная ж.д.",
        "г.Воронеж.-Юго-Восточная ж.д.",
    ],
    [
        "г.Горький - Горьковская жел.дор.",
        "Горьковская ж.д.- гор.Горький",
        "г.Горький.-Горьковская ж.д.",
    ],
    [
        "Армянская ССР",
        "Армения",
    ],
    [
        "г.Гомель.-Белорусская ж.д.",
        "Гомель. Белорусская ж.д.",
        "г.Гомель. Белорусская ж.д.",
    ],
    [
        "Красноярский край",
        "Красноярский Край",
    ],
    [
        "г.Красноярск. Красноярская жел.дор.",
        "г.Красноярск - ДТО ГУГБ Красноярской ж.д.",
    ],
    [
        "г.Куйбышев. Куйбышевская жел.дор.",
        "г.Куйбышев. Жел.дор.им.Куйбышева",
        "Куйбышевская жел.дор.",
    ],
    [
        "Москва-центр",
        "Москва-Центр",
        "Москва-центр // Выписка из списка утвержденного 22/XI 1937г.",
        "Москва-центр // Список",
        "Москва - центр",
        "Москва-центр (бывшие сотрудники НКВД)",
        "Москва-центр (быв.сотрудники НКВД)",
        "Москва-центр // (б.сотрудники НКВД)",
    ],
    [
        "Московская область",
        "Московская Область",
    ],
    [
        "г.Москва. Жел.дор.им.Дзержинского",
        "Москва. Жел.дор.им.Дзержинского",
        "Москва - жел.дор. им.Дзержинского",
        "г.Москва.Жел.дор.им.Дзержинского",
        "ДТО ГУГБ НКВД Дзержинской ж.д. // (г.Москва)",
        "Гор.Москва. Жел.Дор.им.Дзержинского",
        "Жел.дор.им.Дзержинского",
    ],
    [
        "г.Калуга - Московско-Киевская жел.дорога",
        "Калуга // Московско-Киевская жел.дорога",
    ],
    [
        "г.Москва.Ленинская жел.дор.",
        "ДТО ГУГБ НКВД Ленинской ж.д. // (г.Москва)",
    ],
    [
        "г.Калуга. Моск.Киевская жел.дор.",
        "г.Калуга. Моск.Киевск.ж.д.",
        "г.Калуга.-Моск.Киевская жел.дор.",
    ],
#    [
        "Московская область // 5 отдел УГБ",
        "Московская область // Калуга",
        "ДТО ГУГБ Московского узла",
        "ДТО ГУГБ НКВД М-Киевской ж.д. (г.Калуга)",
        "[Москва, октябрь 1936 - <I>сост</I>]",
        "Гор.Калуга. Моск.Киевская жел.дор.",
        "Московско-Окружная ж.д.",
        "Ленинская жел.дор.",
#    ],
    [
        "г.Москва. Московско-окружн.ж.д.",
        "г.Москва. Моск.Окружная жел.дор.",
    ],
    [
        "Москва. ДТО Метро",
        "ДТО ГУГБ Метро (г.Москва)",
        "ДТО [УГБ зачеркнуто] УНКВД МО по Метро",
    ],
    [
        "г.Тбилиси - Закавказская жел.дор.",
        "Закавказская жел.дор.",
    ],
    [
        "г.Новосибирск. Томская жел.дор.",
        "Новосибирск. Томская жел.дор.",
        "Гор.Новосибирск - Томская жел.дор.",
    ],
    [
        "Гор.Омск.-Омская жел.дор.",
        "Омск - Омская жел.дор.",
        "г.Омск Омская жел.дор.",
    ],
    [
        "Орджоникидзевский край",
        "Орджоникидзевский Край",
    ],
    [
        "Оренбург - Оренбургская жел.дорога",
        "Оренбург. Оренбургская ж.д.",
        "г.Оренбург - Оренбургская ж.д.",
    ],
    [
        "Гор.Ростов - ж.д.им.Ворошилова",
        "Ростов н/Д. Жел.дор.им.Ворошилова",
        "г.Ростов ж.д. им.Ворошилова",
    ],
    [
        "Саратовская область",
        "Саратовская область // (Группа Гофман-Леова)",
    ],
    [
        "гор.Саратов - Рязано-Уральская жел.дор.",
        "г.Саратов.-Рязано-Уральская ж.д.",
    ],
    [
        "гор.Свердловск - ж.д. им.Кагановича",
        "г.Свердловск - жел.дор.им.Кагановича",
        "г.Свердловск - железная дорога им.Кагановича",
        "Гор.Свердловск. Жел.дор.им.Кагановича",
    ],
    [
        "Казахская ССР",
        "Казахстан",
    ],
    [
        "гор.Смоленск. Западная жележная дорога",
        "г.Смоленск. Западная жел.дор.",
    ],
    [
        "г.Сталинград - Сталинградская ж.д.",
        "Сталинград - Сталинградская жел.дорога",
        "Гор.Сталинград. Сталинградская жел.дорога:",
    ],
    [
        "г.Казань. Казанская жел.дор.",
        "Казань. Казанская ж.д.",
    ],
    [
        "г.Челябинск. Южно-Уральская ж.д.",
        "Челябинск.Южно-Уральская жел.дорога",
        "Челябинск - Южно-Уральская жел.дор.",
        "Челябинск - Южно-Уральская ж/д.",
        "Челябинск - Южно-Уральской ж.д.",
    ],
    [
        "Чечено-Ингушская АССР",
        "Чечено-Ингушской АССР",
    ],
    [
        "г.Ярославль - Ярославская жел.дор.",
        "Ярославль - Ярославская жел.дор.",
        "Гор.Ярославль.-Ярославская ж.д.",
    ],
    [
        "г.Ташкент - Ташкентская жел.дорога",
        "Гор.Ташкент. Ташкентская жел.дор.",
    ],
    [
        "Винницкая область",
        "Украинская ССР // Винницкая область",
    ],
    [
        "г.Днепропетровск",  # new
        "Украина // Днепропетровск",
        "Украинская ССР // г.Днепропетровск",
    ],
    [
        "Днепропетровская область",
        "Украинская ССР // Днепропетровская область",
    ],
    [
        "г.Днепропетровск - Сталинская жел.дорога",
        "Днепропетровск // Сталинская жел.дорога",
        "Днепропетровск.Сталинская жел.дорога",
        "Днепропетровск. Сталинская ж.д.",
        "Гор.Днепропетровск - Сталинская ж.д.",
        "Украинская ССР // Днепропетровск - Сталинская жел.дор.",
    ],
    [
        "Донецкая область",
        "Украинская ССР // Донецкая область",
        "Украина // Донбасс",
        "Украинская ССР // г.Сталино",
        "Украинская ССР",
        "Украинская ССР // Сталинская область",
        "ст.Ясиноватая. Южно-Донецкой ж.д.",
        "Гор.Артемовск. Северо-Донецкая ж.д.",
    ],
    [
        "Казахская ССР // г.Алма-Ата и Алма-Атинская область",
        "Казахская ССР // Гор.Алма-Ата и Алмаатинская область",
        "Казахская ССР // гор.Алма-Ата и Алмаатинская область",
        "Казахская ССР // Алма-Атинская область",
        "Казахская ССР // Алма-Ата-центр",
    ],
    [
        "г.Алма-Ата - Туркестано-Сибирская ж.д.",
        "Казахская ССР // Туркестано-Сибирская ж.д.",
        "Алма-Ата - Туркестано-Сибирской ж.д.",
        "г.Алма-Ата. Туркестано-Сибирск.ж.д.",
        "г.Алма-Ата - Турксиб.жел.дор.",
    ],
    [
        "г.Киев", # new
        "Украина // Киев",
        "Украинская ССР // г.Киев",
        "Киевский Военный Округ",
        "Центральный аппарат УГБ НКВД УССР",
        "Украинская ССР",
        "Украинская ССР // Центральный аппарат УГБ НКВД",
    ],
    [
        "Украинская ССР // Киев-центр",
        "Украинская ССР // Киев - центр",
    ],
    [
        "Гор.Киев.-Юго-Западная ж.д.",
        "Киев // Юго-Западная железн.дорога",
        "ДТО ГУГБ НКВД Юго-Западн.ж.д. // г.Киев",
        "ДТО ГУГБ НКВД Юго-Западн.ж.д. (г.Киев)",
    ],
    [
        "Украинская ССР // Киевский военный округ",
        "Украинская ССР // Киевский Военный Округ",
    ],
    [
        "Киевская область",
        "Украинская ССР // Киевская область",
    ],
    [
        "Николаевская область", # new
        "Украинская ССР // Николаевская область",
        "Украинская ССР (иноподданные) // Николаевская область",
    ],
    [
        "Одесская область",
        # TODO this can be merged with "Одесская область", but in order to do that, we need to add geo_id too
        # "Украинская ССР",
        "Украинская ССР // Одесская область",
    ],
    [
        "г.Одесса",  # new
        "Украина // Одесса",
        "Украинская ССР // г.Одесса",
    ],
    [
        "Гор.Одесса - Одесская ж.д.",
        "Одесса. Одесская жел.дор.",
        "Одесская жел.дорога",
    ],
    [
        "г.Харьков",  # new
        "Украина // Харьков",
        "Украинская ССР // г.Харьков",
    ],
    [
        "Харьковский Военный Округ",
        "Украинская ССР // Харьковский Военный Округ",
        "Украинская ССР // Харьковский военный округ",
    ],
    [
        "Харьковская область",
        "Украинская ССР // Харьковская область",
        "Украинская ССР (иноподданные) // Харьковская область",
        "Украинская ССР",
    ],
    [
        "Черниговская область",
        "Украинская ССР",
        "Украинская ССР // Черниговская область",
    ],
]

if __name__ == "__main__":
    main()

